// Maxima

//-----------------------------------------------------------------------------
// Многочлены
/*
f(x):=(x^2-3)*(x^2-4)*x+0.7; expand(f(x));
fpprintprec:5;
f1(x):=diff(f(x), x)$ f1(x)$
allroots(f(x));
allroots(f1(x));
r1:realroots(f1(x))$

imin:1$ fmin:f(rhs(r1[1]))$
for i from 2 thru 4 do
  if f(rhs(r1[i])) < fmin then
    (imin:i, fmin:f(rhs(r1[i])))$
"min"; float(r1[imin]); fmin;

imax:1$ fmax:f(rhs(r1[1]))$
for i from 2 thru 4 do
  if f(rhs(r1[i])) > fmax then
    (imax:i, fmax:f(rhs(r1[i])))$
"max"; float(r1[imax]); fmax;

wxplot2d(f(x), [x,-2.2,2.2], [y,-9,9]);
*/
// (x^2-1)*(x^2-4)*x+0.1
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center> равен:', 
	'-3.64443', '-0.02501', '0.02501', '1.01644', '1.98644', '!1.99579', '2.00579');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center> равен:', 
	'-2.01443', '!-2.00413', '-1.99501', '0.02501', '1.01644', '1.11644', '1.99579', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-1.00413', '-0.03501', '-0.02501', '0.81644', '1.62644', '1.63579', '!1.64443');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> на отрезке между корнями равно:', 
	'!-3.53143', '-3.52413', '-3.51501', '-0.02501', '0.81644', '1.01644', '1.19579', '1.64443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> на отрезке между корнями достигается в точке:', 
	'!-1.64443', '-1.62413', '-1.62501', '-0.02501', '0.81644', '1.18644', '1.19579', '1.64443');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-2.00413', '-0.03501', '-0.02501', '0.81644', '3.72644', '!3.73143', '3.74143');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.20443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.1</center><br> наименьшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.20443');

// (x^2-1)*(x^2-4)*x+0.2
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center> равен:', 
	'-2.00819', '-0.05015', '0.05015', '1.01644', '1.98644', '!1.99151', '2.00579');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center> равен:', 
	'-2.01443', '!-2.00819', '-1.99015', '0.05015', '1.01644', '1.98644', '1.99579', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-0.54391', '-0.03501', '-0.02501', '0.54391', '1.62644', '1.63579', '!1.64443');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> на отрезке между корнями равно:', 
	'!-3.43143', '-3.42413', '-3.41501', '-0.02501', '0.81644', '1.01644', '1.02579', '1.03443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> на отрезке между корнями достигается в точке:', 
	'!-1.64443', '-1.63413', '-1.62501', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-0.03501', '-0.02501', '0.81644', '1.01644', '!3.83143', '3.84143');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.01644', '1.19579', '1.64443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '0.82644', '0.83579', '1.64443');

// (x^2-1)*(x^2-4)*x+1
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center> равен:', 
	'-2.00819', '-0.05015', '0.05015', '1.01644', '1.98644', '!1.9541', '2.00579');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center> равен:', 
	'-2.04443', '!-2.03850', '-1.99015', '0.05015', '1.01644', '1.98644', '1.99579', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-0.54391', '-0.03501', '-0.02501', '0.54391', '1.62644', '1.63579', '!1.64443');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> на отрезке между корнями равно:', 
	'!-2.63143', '-2.42413', '-2.41501', '-0.02501', '0.81644', '1.01644', '1.02579', '1.03443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> на отрезке между корнями достигается в точке:', 
	'!-1.64443', '-1.63413', '-1.62501', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-0.03501', '-0.02501', '0.81644', '1.01644', '!4.63143', '4.84143');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.01644', '1.19579', '1.64443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '0.82644', '0.83579', '1.64443');


// (x^2-1)*(x^2-4)*x+2
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center> равен:', 
	'-2.00819', '-0.05015', '0.05015', '1.01644', '1.98644', '!1.89555', '2.00579');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center> равен:', 
	'!-2.07198', '-2.03850', '-1.99015', '0.05015', '1.01644', '1.98644', '1.99579', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-0.54391', '-0.03501', '-0.02501', '0.54391', '1.62644', '1.63579', '!1.64443');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> на отрезке между корнями равно:', 
	'!-2.63143', '-2.42413', '-2.41501', '-0.02501', '0.81644', '1.01644', '1.02579', '1.03443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> на отрезке между корнями достигается в точке:', 
	'!-1.63143', '-1.62413', '-1.61501', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-0.03501', '-0.02501', '0.81644', '1.01644', '!5.63143', '5.84143');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '0', '0.29134', '1.01644', '1.19579', '1.64443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+2</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '!-0.29134', '0', '0.81644', '0.82644', '0.83579', '1.64443');


// (x^2-3)*(x^2-4)*x+0.2
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center> равен:', 
	'-2.02253', '-1.99109', '-0.05015', '1.01644', '1.95644', '!1.97114', '1.97326');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center> равен:', 
	'!-2.02254', '-1.99819', '-0.01666', '0.05015', '1.01644', '1.76916', '1.97114', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center><br> на отрезке между корнями достигается в точке:', 
	'-0.83556', '!-0.82598', '-0.03927', '-0.02501', '0.54391', '0.82598', '1.19579', '1.87556');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.2</center><br> на отрезке между корнями равно:', 
	'-6.16158', '!-6.15158', '-6.14413', '-0.03927', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center><br> на отрезке между корнями достигается в точке:', 
	'-1.87556', '-0.82598', '-0.03927', ' 0.81501', '!0.82598', '0.83644', '1.19579', '1.87556');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-3.51927', '-0.02501', '0.81644', '6.54644', '!6.55158');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03927', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.64443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.2</center><br> наименьшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03927', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.64443');


// (x^2-3)*(x^2-4)*x+0.5
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center> равен:', 
	'-2.02253', '-1.99109', '!-0.04171', '1.01644', '1.95644', '1.97114', '1.97326');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.5</center> равен:', 
	'!-2.0501', '-1.99819', '-0.01666', '0.05015', '1.01644', '1.76916', '1.97114', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center><br> на отрезке между корнями достигается в точке:', 
	'-0.83556', '!-0.82599', '-0.03927', '-0.02501', '0.54391', '0.82598', '1.19579', '1.87556');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+0.5</center><br> на отрезке между корнями равно:', 
	'-5.85358', '!-5.85158', '-5.82131', '-0.03927', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center><br> на отрезке между корнями достигается в точке:', 
	'-1.87556', '-0.82598', '-0.03927', ' 0.81501', '!0.82598', '0.83644', '1.19579', '1.87556');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-3.51927', '-0.02501', '0.81644', '6.84132', '!6.85158');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03927', '-0.02501', '0', '0.03451', '1.18644', '1.19579', '!1.87620');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+0.5</center><br> наименьшая мнимая часть равна:', 
	'-1.94443', '!-1.87620', '-0.03927', '!-0.03451', '0', '0.81644', '1.18644', '1.19579', '1.64443');


// (x^2-3)*(x^2-4)*x+1
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center> равен:', 
	'-2.02253', '-1.99109', '!-0.08367', '1.01644', '1.95644', '1.97114', '1.97326');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center> равен:', 
	'!-2.08661', '-1.99819', '-0.01666', '0.05015', '1.01644', '1.76916', '1.97114', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center><br> на отрезке между корнями достигается в точке:', 
	'-0.83556', '!-0.82599', '-0.03927', '-0.02501', '0.54391', '0.82598', '1.19579', '1.87556');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-5x<sup>3</sup>+4x+1</center><br> на отрезке между корнями равно:', 
	'-5.85358', '!-5.35158', '-5.34131', '-0.03927', '-0.02501', '0.81644', '1.01644', '1.63579', '1.64443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center><br> на отрезке между корнями достигается в точке:', 
	'-1.87556', '-0.82598', '-0.03927', ' 0.81501', '!0.82599', '0.83644', '1.19579', '1.87556');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-3.51927', '-0.02501', '0.81644', '7.34158', '!7.35158');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03927', '-0.02501', '0', '!0.13997', '1.18644', '1.19579', '1.64443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-7x<sup>3</sup>+12x+1</center><br> наименьшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03927', '!-0.13997', '0', '0.81644', '1.18644', '1.19579', '1.64443');


// x-1)*(x-2)*(x-3)*(x-4)*(x-5)+1
add_tsk( 'Наибольший действительный корень многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center> равен:', 
	'-3.64443', '-0.02501', '0.02501', '1.01644', '1.98644', '4.9541', '5.0579');
add_tsk( 'Наименьший действительный корень многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center> равен:', 
	'-2.01443', '-2.00413', '-1.99501', '!0.9615', '1.01644', '1.11644', '1.99579', '2.99579');

add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-1.00413', '-0.03501', '-0.02501', '0.81644', '1.62644', '1.63579', '!4.6444');
add_tsk( 'Наименьшее значение многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-2.6314', '-3.51501', '-0.02501', '0.81644', '1.01644', '1.19579', '1.64443');

add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-1.62413', '-1.62501', '-0.02501', '0.81644', '1.3556', '1.19579', '1.64443');
add_tsk( 'Наибольшее значение многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-2.00413', '-0.03501', '-0.02501', '0.81644', '3.72644', '!4.6314', '4.6414');

add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> наибольшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.20443');
add_tsk( 'Среди комплексных корней многочлена<br><br><center>x<sup>5</sup>-15x<sup>4</sup>+85x<sup>3</sup>-225x<sup>2</sup>+274x-119</center><br> наименьшая мнимая часть равна:', 
	'-1.64443', '-1.10413', '-0.03501', '-0.02501', '!0', '0.81644', '1.18644', '1.19579', '1.20443');



//-----------------------------------------------------------------------------
// Рациональные функции
// (x^3-2x+0.7)/(x^4+x+1)
add_tsk( 'Наибольший действительный корень функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center> равен:', 
	'-1.57576', '-1.56443', '-0.05844', '0.09292', '0.37673', '!1.18769', '1.19013');
add_tsk( 'Наименьший действительный корень функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center> равен:', 
	'-1.57576', '!-1.56443', '-0.05844', '0.09292', '0.37673', '1.18769', '1.19013');

add_tsk( 'Наименьшее значение функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center><br> достигается в точке:', 
	'!-2.58783', '-2.57948', '0.71725', '0.93743', '1.54391', '1.82598', '2.19579', '2.20556');
add_tsk( 'Наименьшее значение функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center><br> равно:', 
    '-5.65158', '-0.27413', '!-0.26478', '0.02217', '0.81644', '1.18644', '1.19579', '7.64443');

add_tsk( 'Наибольшее значение функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center><br> достигается в точке:', 
	'-1.87556', '-0.67598', '!-0.66948', '-0.02217', '0.22598', '0.71644', '0.72598');
add_tsk( 'Наибольшее значение функции<br><br><center>(x<sup>3</sup>-2x+0.7)/(x<sup>4</sup>+x+1)</center><br> равно:', 
	'-0.03927', '-0.02217', '0', '0.09292', '1.01644', '!3.27225', '3.28225');

// (x^3-2x+1)/(x^4+x+1)
add_tsk( 'Наибольший действительный корень функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center> равен:', 
	'-1.57576', '-1.56443', '-0.05844', '0.09292', '!0.618034', '1.18769', '2.36534');
add_tsk( 'Наименьший действительный корень функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center> равен:', 
	'-2.66733', '!-1.61803', '-0.05844', '0.09292', '0.37673', '1.18769', '1.19013');

add_tsk( 'Наименьшее значение функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center><br> достигается в точке:', 
	'-2.78783', '!-2.66691', '0.71725', '0.93743', '1.54391', '1.82598', '2.19579', '2.20556');
add_tsk( 'Наименьшее значение функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center><br> равно:', 
    '-5.65158', '-0.27413', '!-0.258268', '0.02217', '0.81644', '1.18644', '1.19579', '7.64443');

add_tsk( 'Наибольшее значение функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center><br> достигается в точке:', 
	'-1.87556', '-0.67598', '!-0.66487', '-0.02217', '0.22598', '0.71644', '0.72598');
add_tsk( 'Наибольшее значение функции<br><br><center>(x<sup>3</sup>-2x+1)/(x<sup>4</sup>+x+1)</center><br> равно:', 
	'-0.03927', '-0.02217', '0', '0.09292', '1.01644', '3.27225', '!3.83728');


// (x^3-3x+0.7)/(2x^4+x+1)
add_tsk( 'Наибольший действительный корень функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center> равен:', 
	'-1.83867', '0.2378', '!1.60085', '1.61085', '3.70085');
add_tsk( 'Наименьший действительный корень функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center> равен:', 
	'!-1.83867', '-1.8278', '1.60085', '2.60085', '2.61085');

add_tsk( 'Наименьшее значение функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center><br> достигается в точке:', 
	'-3.11647',  '-3.10135', '!0.73050', '0.73124');
add_tsk( 'Наименьшее значение функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center><br> равно:', 
    '-5.651583616', '!-0.54667', '-0.53667', '0.025019');

add_tsk( 'Наибольшее значение функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center><br> достигается в точке:', 
	'-0.70401',  '!-0.69471', '2.91947', '2.92133');
add_tsk( 'Наибольшее значение функции<br><br><center> (x<sup>3</sup>-3x+0.7)/(2x<sup>4</sup>+x+1) </center><br> равно:', 
	'-0.0350195', '-0.025019', '0.092925', '1.016445', '!4.54995', '4.55000');


// (x^3-3x+1)/(2x^4+x+1)
add_tsk( 'Наибольший действительный корень функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center> равен:', 
	'-1.83867', '0.2378', '!1.53209', '1.61085', '3.70085');
add_tsk( 'Наименьший действительный корень функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center> равен:', 
	'!-1.87939', '-1.8278', '1.60085', '2.60085', '2.61085');

add_tsk( 'Наименьшее значение функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center><br> достигается в точке:', 
	'-3.11647',  '-3.10135', '!0.78108', '0.73124');
add_tsk( 'Наименьшее значение функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center><br> равно:', 
    '-5.651583616', '-0.54667', '-0.40251', '0.025019');

add_tsk( 'Наибольшее значение функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center><br> достигается в точке:', 
	'-0.70401',  '!-0.68902', '2.91947', '2.92133');
add_tsk( 'Наибольшее значение функции<br><br><center> (x<sup>3</sup>-3x+1)/(2x<sup>4</sup>+x+1) </center><br> равно:', 
	'-0.0350195', '-0.025019', '0.092925', '1.016445', '4.54995', '!5.10835');



//-----------------------------------------------------------------------------
// экспоненты
// 6^x+7^x = 8^x
add_tsk( 'Наибольший действительный корень уравнения<br><br><center>6<sup>x</sup>+7<sup>x</sup>=8<sup>x</sup></center> равен:', 
	'-2.00083', '0.00842', '0.98337', '0.99238', '3.44238', '!3.4579');
add_tsk( 'Наименьший действительный корень уравнения<br><br><center>6<sup>x</sup>+7<sup>x</sup>=8<sup>x</sup></center> равен:', 
	'-2.00083', '0.00842', '0.98337', '0.99238', '3.44238', '!3.4579');
add_tsk( 'Наибольшее значение функции<br><br><center> 6<sup>x</sup>+7<sup>x</sup>-8<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '2.93947', '!2.9494', '&infin;');
add_tsk( 'Наибольшее значение функции<br><br><center> 6<sup>x</sup>+7<sup>x</sup>-8<sup>x</sup> </center><br> равно:', 
	'-&infin;','-3.11647',  '-3.10135', '0.66947', '!47.2500', '47.269', '&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 6<sup>x</sup>+7<sup>x</sup>-8<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '2.93947', '2.9494', '!&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 6<sup>x</sup>+7<sup>x</sup>-8<sup>x</sup> </center><br> равно:', 
	'!-&infin;','-3.11647',  '-0.58135', '0.66947', '47.2500', '47.263', '&infin;');

// 3^x+4^x = 5^x
add_tsk( 'Наибольший действительный корень уравнения<br><br><center>3<sup>x</sup>+4<sup>x</sup>=5<sup>x</sup></center> равен:', 
	'-2.00083', '0.00842', '1.98337', '!2', '2.01238', '2.996643');
add_tsk( 'Наименьший действительный корень уравнения<br><br><center>3<sup>x</sup>+4<sup>x</sup>=5<sup>x</sup></center> равен:', 
	'-2.00083', '0.00842', '1.98337', '!2', '2.01238', '2.996643');
add_tsk( 'Наибольшее значение функции<br><br><center> 3<sup>x</sup>+4<sup>x</sup>-5<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-3.10135', '0.66947', '!1.28714', '1.29947', '&infin;');
add_tsk( 'Наибольшее значение функции<br><br><center> 3<sup>x</sup>+4<sup>x</sup>-5<sup>x</sup> </center><br> равно:', 
	'-&infin;','-3.11647',  '-3.10135', '2.12647', '!2.1310', '122.669', '&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 3<sup>x</sup>+4<sup>x</sup>-5<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-1.58135', '0.66947', '2.9494', '!&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 3<sup>x</sup>+4<sup>x</sup>-5<sup>x</sup> </center><br> равно:', 
	'!-&infin;','-3.11647',  '-1.58135', '0.66947', '47.2500', '122.669', '&infin;');

// 5^x+6^x = 8^x
add_tsk( 'Наибольший действительный корень уравнения<br><br><center>5<sup>x</sup>+6<sup>x</sup>=8<sup>x</sup></center> равен:', 
	'-2.00083', '!1.8677', '1.87337', '2.50238', '2.51238', '2.996643');
add_tsk( 'Наименьший действительный корень уравнения<br><br><center>5<sup>x</sup>+6<sup>x</sup>=8<sup>x</sup></center> равен:', 
	'-2.00083', '!1.8677', '1.87337', '2.50238', '2.51238', '2.996643');
add_tsk( 'Наибольшее значение функции<br><br><center> 5<sup>x</sup>+6<sup>x</sup>-8<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '1.32947', '!1.3354', '&infin;');
add_tsk( 'Наибольшее значение функции<br><br><center> 5<sup>x</sup>+6<sup>x</sup>-8<sup>x</sup> </center><br> равно:', 
	'-&infin;','-3.11647',  '-1.58135', '0.66947', '!3.4526', '3.469', '&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 5<sup>x</sup>+6<sup>x</sup>-8<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-2.58135', '0.66947', '2.9494', '!&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 5<sup>x</sup>+6<sup>x</sup>-8<sup>x</sup> </center><br> равно:', 
	'!-&infin;','-3.11647',  '-3.10135', '0.66947', '47.2500', '122.669', '&infin;');

// 2^x+5^x = 7^x
add_tsk( 'Наибольший действительный корень уравнения<br><br><center>2<sup>x</sup>+5<sup>x</sup>=7<sup>x</sup></center> равен:', 
	'-2.00083', '!1', '1.01337', '2.01238', '2.02238', '2.996643');
add_tsk( 'Наименьший действительный корень уравнения<br><br><center>2<sup>x</sup>+5<sup>x</sup>=7<sup>x</sup></center> равен:', 
	'-2.00083', '!1', '1.01337', '2.01238', '2.02238', '2.996643');
add_tsk( 'Наибольшее значение функции<br><br><center> 2<sup>x</sup>+5<sup>x</sup>-7<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '0.27947', '!0.28626', '&infin;');
add_tsk( 'Наибольшее значение функции<br><br><center> 2<sup>x</sup>+5<sup>x</sup>-7<sup>x</sup> </center><br> равно:', 
	'-&infin;','-0.59647',  '-0.58135', '1.04947', '!1.0591945', '&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 2<sup>x</sup>+5<sup>x</sup>-7<sup>x</sup> </center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '0.66947', '2.9494', '!&infin;');
add_tsk( 'Наименьшее значение функции<br><br><center> 2<sup>x</sup>+5<sup>x</sup>-7<sup>x</sup> </center><br> равно:', 
	'!-&infin;','-3.11647',  '-0.58135', '0.66947', '47.2500', '122.669', '&infin;');

// 5^x+6^x = 8^x
sfunc = '2<sup>x</sup>+7<sup>x</sup>-9<sup>x</sup>';
add_tsk( 'Наибольший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'-2.00083', '0.8677', '!1', '1.01238', '2.51238', '2.996643');
add_tsk( 'Наименьший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'-2.00083', '-1.8677', '0.99337', '!1', '2.51238', '2.996643');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '0.66947', '1.3354', '!&infin;');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> равно:', 
	'!-&infin;','-3.11647',  '-1.58135', '0.66947', '3.4526', '4.669', '&infin;');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> достигается в точке:', 
	'-&infin;','-3.11647',  '-0.58135', '0.33947', '!0.344641', '1.26947', '&infin;');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> равно:', 
	'-&infin;','-3.11647',  '-1.58135', '1', '!1.093', '1.1001', '&infin;');

//-----------------------------------------------------------------------------
// Тригонометрия
//  x - 2sin(x) + 0.3
sfunc = 'x - 2 sin(x) + 0.3';
add_tsk( 'Наибольший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'-2.06278', '-0.02501', '1.00987', '1.01644', '1.67644', '!1.68660', '3.99579');
add_tsk( 'Наименьший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'!-2.06278', '-2.05501', '0.30987', '1.01644', '1.11644', '1.68660', '3.99579');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-1.04720', '-1.03501', '-0.02501', '1.03644', '!1.04720', '2.19579', '2.64443');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-0.39413', '!-0.3848', '-0.02501', '0.81644', '1.01644', '1.02579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-1.03443', '!-1.0472', '-0.03501', '-0.02501', '0.81644', '0.82644', '1.19579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-2.00413', '-0.03501', '-0.02501', '0.81644', '!0.98485', '0.99143', '4.73143');

//  x - 2cos(x) + 1
sfunc = 'x - 2 cos(x) + 1';
add_tsk( 'Наибольший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'-2.97095', '-0.02501', '0.30987', '1.01644', '0.61644', '!0.623582', '1.99579', '3.99579');
add_tsk( 'Наименьший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'!-2.97095', '-2.96501', '0.30987', '1.01644', '1.11644', '1.68660', '3.99579');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-1.04720', '!-0.52360', '-0.51501', '0.81644', '1.04720', '1.05579', '2.64443');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-1.26413', '!-1.25565', '-0.02501', '0.81644', '1.01644', '1.02579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-2.64443', '!-2.61800', '-0.03501', '-0.02501', '0.81644', '1.01644', '1.02579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-3.53143', '-3.52413', '-0.03501', '-0.02501', '0.10816', '!0.11406', '3.73143', '4.73143');

//  x - 2cos(x) + 2
sfunc = 'x - 2 cos(x) + 2';
add_tsk( 'Наибольший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'-2.97095', '-0.02501', '!0', '0.03097', '0.04644', '1.11644', '1.99579', '3.99579');
add_tsk( 'Наименьший действительный корень уравнения <br><br><center>' +sfunc + '=0</center> равен:', 
	'!-3.698153', '-3.68501', '0.30987', '1.01644', '1.02644', '1.68660', '3.99579');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-1.64443', '-0.53720', '!-0.523600', '-0.02501', '0.81644', '1.04720', '2.63579', '2.64443');
add_tsk( 'Наименьшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-0.27143', '-0.26413', '!-0.25565', '-0.02501', '0.81644', '1.01644', '1.19579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями достигается в точке:', 
	'-3.64443', '!-2.61800', '-0.03501', '-0.02501', '0.81644', '1.01644', '1.19579', '1.64443');
add_tsk( 'Наибольшее значение функции <br><br><center>' + sfunc +'</center><br> на отрезке между корнями равно:', 
	'-2.01143', '-2.00413', '-0.03501', '-0.02501', '0.00816', '!1.11406', '1.12143', '1.13143');

//-----------------------------------------------------------------------------
/*
 fppprec:100;
 x:sqrt(3); float(x);
 for k from 30 thru 60 step 5 do (
    y:mod(floor(bfloat(x*10**k)),10) ,
    print(k, y));
*/

//  цифры sqrt(3)
//	'0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
sfunc = 'sqrt(3)';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');

//  цифры sqrt(*)
sfunc = 'sqrt(5)';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');

//  цифры sqrt(7) 
sfunc = 'sqrt(7)';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');


//  цифры %pi^2
sfunc = '&pi;<sup>2</sup>';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');

//  цифры %pi^3
sfunc = '&pi;<sup>3</sup>';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'!0', '1', '2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');

//  цифры %pi/4 
sfunc = '&pi;/4';
add_tsk( '30-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '35-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '!6', '7', '8', '9');
add_tsk( '40-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');
add_tsk( '45-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '50-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '4', '5', '6', '7', '!8', '9');
add_tsk( '55-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '!2', '3', '4', '5', '6', '7', '8', '9');
add_tsk( '60-я цифра после запятой числа <br><br><center>' +sfunc + '</center> равна:', 
	'0', '1', '2', '3', '!4', '5', '6', '7', '8', '9');

//-----------------------------------------------------------------------------
// Наименьшее простое число, большее 10^k
add_tsk( 'Наименьшее простое число, большее 2 000:', 
	'!2003', '2007', '2009', '2013', '2017', '2019', '2021', '2027' );
add_tsk( 'Наименьшее простое число, большее 3 000:', 
	'!3001', '3003', '3007', '3013', '3017', '3019', '3021', '3027' );
add_tsk( 'Наименьшее простое число, большее 4 000:', 
	'!4001', '4003', '4007', '4013', '4017', '4019', '4021', '4027' );
add_tsk( 'Наименьшее простое число, большее 5 000:', 
	'5001', '!5003', '5007', '5013', '5017', '5019', '5021', '5027' );
add_tsk( 'Наименьшее простое число, большее 6 000:', 
	'6001', '6003', '!6007', '6013', '6017', '6019', '6021', '6027' );
add_tsk( 'Наименьшее простое число, большее 7 000:', 
	'!7001', '7003', '7007', '7013', '7017', '7019', '7021', '7027' );
add_tsk( 'Наименьшее простое число, большее 8 000:', 
	'8001', '8003', '8007', '!8009', '8017', '8019', '8021', '8027' );
add_tsk( 'Наименьшее простое число, большее 9 000:', 
	'!9001', '9003', '9007', '9013', '9017', '9019', '9021', '9027' );
add_tsk( 'Наименьшее простое число, большее 11 000:', 
	'11001', '!11003', '11007', '11013', '11017', '11019', '11021', '11027' );
add_tsk( 'Наименьшее простое число, большее 12 000:', 
	'12001', '12003', '!12007', '12013', '12017', '12019', '12021', '12027' );
add_tsk( 'Наименьшее простое число, большее 13 000:', 
	'!13001', '13003', '13007', '13013', '13017', '13019', '13021', '13027' );
add_tsk( 'Наименьшее простое число, большее 14 000:', 
	'14001', '14003', '14007', '!14009', '14017', '14019', '14021', '14027' );
add_tsk( 'Наименьшее простое число, большее 15 000:', 
	'15001', '15003', '15007', '!15013', '15017', '15019', '15021', '15027' );
add_tsk( 'Наименьшее простое число, большее 16 000:', 
	'!16001', '16003', '16007', '16013', '16017', '16019', '16021', '16027' );
add_tsk( 'Наименьшее простое число, большее 17 000:', 
	'17001', '17003', '17007', '!17011', '17017', '17019', '17021', '17027' );
add_tsk( 'Наименьшее простое число, большее 18 000:', 
	'18001', '18003', '18007', '!18013', '18017', '18019', '18021', '18027' );
add_tsk( 'Наименьшее простое число, большее 19 000:', 
	'!19001', '19003', '19007', '19013', '19017', '19019', '19021', '19027' );
add_tsk( 'Наименьшее простое число, большее 20 000:', 
	'20001', '20003', '20007', '!20011', '20017', '20019', '20021', '20027' );

add_tsk( 'Наименьшее простое число, большее 10 000:', 
	'10003', '!10007', '10009', '10013', '10017', '10019', '10021', '10027' );
add_tsk( 'Наименьшее простое число, большее 100 000:', 
	'!100003', '100007', '100009', '100013', '100017', '100019', '100021', '100027' );
add_tsk( 'Наименьшее простое число, большее 1000 000:', 
	'!1000003', '1000007', '1000009', '1000013', '1000017', '1000019', '1000021', '1000027' );
add_tsk( 'Наименьшее простое число, большее 10 000 000:', 
	'10000003', '10000007', '10000009', '10000013', '10000017', '!10000019', '10000021', '10000027' );
add_tsk( 'Наименьшее простое число, большее 100 000 000:', 
	'100000003', '!100000007', '100000009', '100000013', '100000017', '100000019', '100000021', '100000027' );
add_tsk( 'Наименьшее простое число, большее 1000 000 000:', 
	'1000000003', '!1000000007', '1000000009', '1000000013', '1000000017', '1000000019', '1000000021', '1000000027' );
add_tsk( 'Наименьшее простое число, большее 10 000 000 000:', 
	'10000000003', '10000000007', '10000000009', '10000000013', '10000000017', '!10000000019', '10000000021', '10000000027' );

//-----------------------------------------------------------------------------
// наименьший простой делитель
add_tsk( 'Наименьший простой делитель числа 2<sup>30</sup>+1:', 
	'3', '!5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>35</sup>+1:', 
	'!3', '5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>40</sup>+1:', 
	'3', '5', '7', '11', '13', '17', '19', '!257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>45</sup>+1:', 
	'!3', '5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>50</sup>+1:', 
	'3', '!5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>55</sup>+1:', 
	'!3', '5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>60</sup>+1:', 
	'3', '5', '7', '11', '13', '!17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>65</sup>+1:', 
	'!3', '5', '7', '11', '13', '17', '19', '257' );
add_tsk( 'Наименьший простой делитель числа 2<sup>70</sup>+1:', 
	'3', '!5', '7', '11', '13', '17', '19', '257' );

// наименьший простой делитель
add_tsk( 'Наименьший простой делитель числа 10<sup>30</sup>+1:', 
	'7', '11', '17', '29', '!61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>35</sup>+1:', 
	'7', '!11', '17', '29', '61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>40</sup>+1:', 
	'7', '11', '!17', '29', '61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>45</sup>+1:', 
	'!7', '11', '17', '29', '61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>50</sup>+1:', 
	'7', '11', '17', '29', '61', '73', '!101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>55</sup>+1:', 
	'7', '!11', '17', '29', '61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>60</sup>+1:', 
	'7', '11', '17', '29', '61', '!73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>65</sup>+1:', 
	'7', '!11', '17', '29', '61', '73', '101', '257' );
add_tsk( 'Наименьший простой делитель числа 10<sup>70</sup>+1:', 
	'7', '11', '17', '!29', '61', '73', '101', '257' );

//-----------------------------------------------------------------------------
// наименьшее псевдопростое
add_tsk( 'Наименьшее составное число k такое, что 2<sup>k-1</sup> mod k равно 1:', 
	'11','91','121','217', '!341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 3<sup>k-1</sup> mod k равно 1:', 
	'11','!91','121','217', '341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 5<sup>k-1</sup> mod k равно 1:', 
	'11','91','121','!217', '341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 7<sup>k-1</sup> mod k равно 1:', 
	'!25','91','121','217', '341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 11<sup>k-1</sup> mod k равно 1:', 
	'!15','91','121','217', '341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 13<sup>k-1</sup> mod k равно 1:', 
	'15','!21','121','217', '341' ,'567' );
add_tsk( 'Наименьшее составное число k такое, что 17<sup>k-1</sup> mod k равно 1:', 
	'15','!45','121','217', '341' ,'567' );

//-----------------------------------------------------------------------------
// производная в точке
sfunc = '(x<sup>3</sup>+1)/(x<sup>4</sup>-x<sup>2</sup>+x+2)';
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -3 равна:', 
	'-0.3125','-0.26953','-0.25','!-0.14065','-0.13577','0.33333','3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -2 равна:', 
	'!-0.3125','-0.26953','-0.25','-0.14065','-0.13577','0.33333','3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -1 равна:', 
	'-0.3125','-0.26953','-0.25','-0.14065','-0.13577','0.33333','!3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 0 равна:', 
	'-0.3125','-0.26953','!-0.25','-0.14065','-0.13577','0.33333','3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 1 равна:', 
	'-0.3125','-0.26953','-0.25','-0.14065','-0.13577','!0.33333','3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 2 равна:', 
	'-0.3125','!-0.26953','-0.25','-0.14065','-0.13577','0.33333','3');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'-0.3125','-0.26953','-0.25','-0.14065','!-0.13577','0.33333','3');

sfunc = 'sin(x)/(x<sup>2</sup>+x+2)';
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -3 равна:', 
	'-0.27453','!-0.13477','-0.12306','-0.075754','-0.0227','0.059783','0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -2 равна:', 
	'!-0.27453','-0.13477','-0.12306','-0.075754','-0.0227','0.059783','0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -1 равна:', 
	'-0.27453','-0.13477','-0.12306','-0.075754','-0.0227','!0.059783','0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 0 равна:', 
	'-0.27453','-0.13477','-0.12306','-0.075754','-0.0227','0.059783','!0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 1 равна:', 
	'-0.27453','-0.13477','-0.12306','-0.075754','!-0.0227','0.059783','0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 2 равна:', 
	'-0.27453','-0.13477','!-0.12306','-0.075754','-0.0227','0.059783','0.5');
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'-0.27453','-0.13477','-0.12306','!-0.075754','-0.0227','0.059783','0.5');

sfunc = 'e<sup>x</sup>/(x<sup>2</sup>+x+2)';
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -3 равна:', 
	'!0.010113', '0.059209', '0.16989', '0.25', '0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -2 равна:', 
	'0.010113', '!0.059209', '0.16989', '0.25', '0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -1 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '!0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 0 равна:', 
	'0.010113', '0.059209', '0.16989', '!0.25', '0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 1 равна:', 
	'0.010113', '0.059209', '!0.16989', '0.25', '0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 2 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '0.27591', '!0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '0.27591', '0.34636', '!0.71734' );

sfunc = 'sin(sqrt(x*x+3))';
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -3 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '0.27591', '0.34636', '!0.82138' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -2 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '0.27591', '!0.66489', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке -1 равна:', 
	'0.010113', '0.059209', '0.16989', '0.25', '!0.20807', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 1 равна:', 
	'-2.0113', '-1.59209', '!-0.20807', '0.25', '0.27591', '0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 2 равна:', 
	'-1.00113', '!-0.66489', '0.16989', '0.25', '0.27591', '!0.34636', '0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'-1.20113', '!-0.82138', '0.16989', '0.25', '0.27591', '0.34636', '!0.71734' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'!-0.31767', '0.059209', '0.16989', '0.25', '0.27591', '0.34636', '!0.71734' );


sfunc = 'exp(sqrt(x))';
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 1 равна:', 
	'!1.3591', '1.4543', '1.6317', '1.8473', '2.0922', '2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 2 равна:', 
	'1.3591', '!1.4543', '1.6317', '1.8473', '2.0922', '2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 3 равна:', 
	'1.3591', '1.4543', '!1.6317', '1.8473', '2.0922', '2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 4 равна:', 
	'1.3591', '1.4543', '1.6317', '!1.8473', '2.0922', '2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 5 равна:', 
	'1.3591', '1.4543', '1.6317', '1.8473', '!2.0922', '2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 6 равна:', 
	'1.3591', '1.4543', '1.6317', '1.8473', '2.0922', '!2.3643', '2.6635' );
add_tsk( 'Производная функции <br><br><center>' +sfunc + '</center> в точке 7 равна:', 
	'1.3591', '1.4543', '1.6317', '1.8473', '2.0922', '2.3643', '!2.6635' );


//-----------------------------------------------------------------------------
// ряд Тейлора в точке
sfunc = 'e<sup>x</sup>/(x<sup>2</sup>+x+2)';
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-3) равно:'
	,'!-1.8122' ,'-0.49906' ,'0.19821' ,'0.51322' ,'0.67957' ,'0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-2) равно:'
	,'-1.8122' ,'!-0.49906' ,'0.19821' ,'0.51322' ,'0.67957' ,'0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-1) равно:'
	,'-1.8122' ,'-0.49906' ,'!0.19821' ,'0.51322' ,'0.67957' ,'0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(0) равно:'
	,'-1.8122' ,'-0.49906' ,'0.19821' ,'!0.51322' ,'0.67957' ,'0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(1) равно:'
	,'-1.8122' ,'-0.49906' ,'0.19821' ,'0.51322' ,'!0.67957' ,'0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(2) равно:'
	,'-1.8122' ,'-0.49906' ,'0.19821' ,'0.51322' ,'0.67957' ,'!0.93087' ,'1.5007' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(3) равно:'
	,'-1.8122' ,'-0.49906' ,'0.19821' ,'0.51322' ,'0.67957' ,'0.93087' ,'!1.5007' );

sfunc = 'sin(x)/(x<sup>2</sup>+x+2)';
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-3) равно:'
	,'!-7.6293' ,'-3.3839' ,'-1.017' ,'0.0035919' ,'0.13564' ,'0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-2) равно:'
	,'-7.6293' ,'!-3.3839' ,'-1.017' ,'0.0035919' ,'0.13564' ,'0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(-1) равно:'
	,'-7.6293' ,'-3.3839' ,'!-1.017' ,'0.0035919' ,'0.13564' ,'0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(0) равно:'
	,'-7.6293' ,'-3.3839' ,'-1.017' ,'!0.0035919' ,'0.13564' ,'0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(1) равно:'
	,'-7.6293' ,'-3.3839' ,'-1.017' ,'0.0035919' ,'0.13564' ,'!0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(2) равно:'
	,'-7.6293' ,'-3.3839' ,'-1.017' ,'0.0035919' ,'!0.13564' ,'0.21037' ,'0.31177' );
add_tsk( 'Пусть T(x) &mdash; 3 члена ряда Тейлора функции <br><br><center>' +sfunc + '</center> в точке 1. Тогда T(3) равно:'
	,'-7.6293' ,'-3.3839' ,'-1.017' ,'0.0035919' ,'0.13564' ,'0.21037' ,'!0.31177' );

//-----------------------------------------------------------------------------
// Кубическая интерполяция
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-2)= 1<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=1.<br>Тогда f( 3) равно:'
	,'0' ,'-1' ,'3' ,'!19/2' ,'118/5' ,'-19/2' ,'-118/5' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-2)= 1<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=0.<br>Тогда f( 3) равно:'
	,'0' ,'3' ,'19/2' ,'!13/2' ,'118/5' ,'-19/2' ,'-118/5' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-4)= 4<br>&nbsp;f(-2)= 1<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=0.<br>Тогда f( 3) равно:'
	,'0' ,'19/2' ,'13/2' ,'-19/2' ,'118/5' ,'-118/5' ,'!83/12' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-4)= 1<br>&nbsp;f(-2)= 1<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=0.<br>Тогда f( 3) равно:'
	,'0' ,'13/2' ,'19/2' ,'-19/2' ,'118/5' ,'-118/5' ,'!89/12' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-4)= 1<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=0.<br>Тогда f( 3) равно:'
	,'0'  ,'13/2' ,'-19/2' ,'118/5' ,'-118/5' ,'!409/45' ,'-409/45' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-4)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=0.<br>Тогда f( 3) равно:'
	,'0'  ,'13/2' ,'-19/2' ,'71/3' ,'-71/3' ,'!374/45' ,'-409/45' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-4)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=2.<br>Тогда f( 4) равно:'
	,'0'  ,'!37' ,'-19/2' ,'71/3' ,'-71/3' ,'374/45' ,'-409/45' );

add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=2.<br>Тогда f(3) равно:'
	,'0'  ,'1' ,'79/2','!76/5'  ,'11/5' ,'-27/10' ,'-409/45' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=2.<br>Тогда f(4) равно:'
	,'0'  ,'1' ,'!79/2','76/5'  ,'11/5' ,'-27/10' ,'-409/45' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=2.<br>Тогда f(-2) равно:'
	,'0'  ,'1' ,'79/2','76/5'  ,'!11/5' ,'-27/10' ,'-409/45' );
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 1<br>&nbsp;f(-1)= 0<br>&nbsp;f( 1)=-3<br>&nbsp;f( 2)=2.<br>Тогда f(0) равно:'
	,'0'  ,'1' ,'79/2','76/5'  ,'11/5' ,'!-27/10' ,'-409/45' );

add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(3) равно:'
	,'0'  ,'1' ,'29/2','13/5'  ,'!33/5' ,'-1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(4) равно:'
	,'0'  ,'1' ,'!29/2','13/5'  ,'33/5' ,'-1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(-2) равно:'
	,'0'  ,'1' ,'29/2','!13/5'  ,'33/5' ,'-1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 4<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(0) равно:'
	,'0'  ,'1' ,'29/2','13/5'  ,'33/5' ,'!-1/10');

add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 0<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(3) равно:'
	,'0'  ,'1' ,'35/2','7/5'  ,'!37/5' ,'1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 0<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(4) равно:'
	,'0'  ,'1' ,'!35/2','7/5'  ,'37/5' ,'1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 0<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(-2) равно:'
	,'0'  ,'1' ,'35/2','!7/5'  ,'37/5' ,'1/10');
add_tsk( 'Пусть f(x) &mdash; многочлен степени 3 такой, что:<br>&nbsp;f(-3)= 0<br>&nbsp;f(-1)= 1<br>&nbsp;f( 1)= 0<br>&nbsp;f( 2)=2.<br>Тогда f(0) равно:'
	,'0'  ,'1' ,'35/2','7/5'  ,'37/5' ,'!1/10');

//-----------------------------------------------------------------------------
// Производные
/*
 f(x):=x**x;
 fpprintprec:5;
 f1:diff(f(x), x);
 f2:diff(f(x), x,2);
 float(subst(1,x, f1));  float(subst(2,x, f1));
 float(subst(1,x, f2));  float(subst(2,x, f2));
*/
// x^x
add_tsk( 'Производная функции<br><br><center>x<sup>x</sup></center> в точке 1 равна:' 
	,'!1.0' ,'2.3450' ,'6.7726' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Производная функции<br><br><center>x<sup>x</sup></center> в точке 2 равна:' 
	,'1.2340' ,'2.3450' ,'!6.7726' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Вторая производная функции<br><br><center>x<sup>x</sup></center> в точке 1 равна:'
	,'!2.0' ,'2.3450' ,'3.7726' ,'4.8537' ,'8.36612' ,'13.457');
add_tsk( 'Вторая производная функции<br><br><center>x<sup>x</sup></center> в точке 2 равна:'
	,'1.2340' ,'2.3450' ,'6.7726' ,'8.35612' ,'13.366' ,'!13.467');


// exp(sqrt(x))
add_tsk( 'Производная функции<br><br><center>sin(x)/x</center> в точке 1 равна:' 
	,'-0.30117' ,'-0.10117' ,'!1.3591' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Производная функции<br><br><center>sin(x)/x</center> в точке 2 равна:' 
	,'-0.4354' ,'-0.10117' ,'!1.4543' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Вторая производная функции<br><br><center>sin(x)/x</center> в точке 1 равна:'
	,'-0.23913' ,'!0.0' ,'1.7726' ,'2.35612' ,'2.36612' ,'3.45712');
add_tsk( 'Вторая производная функции<br><br><center>x<sup>x</sup></center> в точке 2 равна:'
	,'-0.34501' ,'-0.019251' ,'!0.15059' ,'2.35612' ,'2.36612' ,'3.45711');

// sin(x)/x
add_tsk( 'Производная функции<br><br><center>exp(sqrt(x))</center> в точке 1 равна:' 
	,'!-0.30117' ,'-0.10117' ,'6.7726' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Производная функции<br><br><center>exp(sqrt(x))</center> в точке 2 равна:' 
	,'!-0.4354' ,'-0.10117' ,'6.7726' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Вторая производная функции<br><br><center>exp(sqrt(x))</center> в точке 1 равна:'
	,'!-0.23913' ,'0.3450' ,'1.7726' ,'2.35612' ,'2.36612' ,'3.457');
add_tsk( 'Вторая производная функции<br><br><center>exp(sqrt(x))</center> в точке 2 равна:'
	,'-0.34501' ,'!-0.019251' ,'1.7726' ,'2.35612' ,'2.36612' ,'3.457');


// cos(sqrt(x))
add_tsk( 'Производная функции<br><br><center>sin(x)/x</center> в точке 1 равна:' 
	,'-6.30117' ,'!-0.42074' ,'1.3591' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Производная функции<br><br><center>sin(x)/x</center> в точке 2 равна:' 
	,'-0.43542' ,'!-0.34923' ,'1.4543' ,'8.35612' ,'8.36612' ,'8.37612');
add_tsk( 'Вторая производная функции<br><br><center>sin(x)/x</center> в точке 1 равна:'
	,'-0.23913' ,'0.0' ,'!0.075292' ,'2.35612' ,'2.36612' ,'3.45712');
add_tsk( 'Вторая производная функции<br><br><center>x<sup>x</sup></center> в точке 2 равна:'
	,'-0.34501' ,'-0.019251' ,'!0.067814' ,'2.35612' ,'2.36612' ,'3.45711');


//-----------------------------------------------------------------------------
// Сумма корней многочлена
// (x-1)(x-2)(x-3)(x-4)+alpha
add_tsk( 'Сумма корней многочлена<br><br><center>x<sup>4</sup>-10x<sup>3</sup>+35x<sup>2</sup>+50x+24.1</center> равна:' 
	,'-11.2340' ,'-3.3461' ,'6.7726' ,'!10.000' ,'10.010' ,'11.3712');
add_tsk( 'Сумма корней многочлена<br><br><center>x<sup>4</sup>-8x<sup>3</sup>+17x<sup>2</sup>+2x-23.9</center> равна:' 
	,'-11.2340' ,'-3.3461' ,'6.7726' ,'!8.0000' ,'10.010' ,'11.3712');
add_tsk( 'Сумма корней многочлена<br><br><center>x<sup>4</sup>-8x<sup>3</sup>+17x<sup>2</sup>+2x-23.1</center> равна:' 
	,'-11.2340' ,'-3.3461' ,'6.7726' ,'!8.0000' ,'10.010' ,'11.3712');
add_tsk( 'Сумма корней многочлена<br><br><center>x<sup>4</sup>-15x<sup>2</sup>+10x-24.1</center> равна:' 
	,'-11.2340' ,'-3.3461' ,'-3.0000' ,'!0.0000' ,'16.010' ,'16.3712');
add_tsk( 'Сумма корней многочлена<br><br><center>x<sup>4</sup>-15x<sup>2</sup>+10x-23.1</center> равна:' 
	,'-11.2340' ,'-3.3461' ,'-2.0000' ,'!0.0000' ,'16.010' ,'16.3712');

//-----------------------------------------------------------------------------
// Интеграл
/*
 fpprintprec:5;
 f: exp(-x**2/2);
 for a in [-2,-1, 0] do
  for b in [a+1, a+2, a+3] do
    print(a, b, romberg(f, x, a, b))$

*/
sfunc = 'exp(-x<sup>2</sup>/2)';
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до -1 равен:', 
	'!0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до 0 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '!1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до 1 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '!2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -1 до 0 равен:', 
	'0.34066', '0.39431', '0.39761', '!0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -1 до 1 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '!1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -1 до 2 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '!2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 1 равен:', 
	'0.34066', '0.39431', '0.39761', '!0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 2 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '!1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 3 равен:', 
	'0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '!1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 2 равен:', 
	'!0.34066', '0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 3 равен:', 
	'0.34066', '!0.39431', '0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 4 равен:', 
	'0.34066', '0.39431', '!0.39761', '0.85562', '1.1963', '1.2499', '1.7112', '2.0519' );


sfunc = '-sin(-x<sup>2</sup>/2)';
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до -1 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '!0.83391', '0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до 0 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '!0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -2 до 1 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '0.99762', '!1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -1 до 1 равен:', 
	'0.16371', '!0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от -1 до 2 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '0.99762', '!1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 1 равен:', 
	'!0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 2 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '0.98635', '!0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 0 до 3 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '0.83391', '!0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 2 равен:', 
	'0.16371', '0.32743', '0.7438', '0.82264', '!0.83391', '0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 3 равен:', 
	'0.16371', '0.32743', '0.7438', '!0.82264', '0.83391', '0.98635', '0.99762', '1.1613');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 4 равен:', 
	'0.16371', '0.32743', '!0.7438', '0.82264', '0.83391', '0.98635', '0.99762', '1.1613');

sfunc = 'exp(x)/x';
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 2 равен:', 
	'!3.0591', '4.9796', '8.0387', '9.697', '14.677', '17.736', '20.554', '30.251', '35.231');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 3 равен:', 
	'3.0591', '4.9796', '!8.0387', '9.697', '14.677', '17.736', '20.554', '30.251', '35.231');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 1 до 4 равен:', 
	'3.0591', '4.9796', '8.0387', '9.697', '14.677', '!17.736', '20.554', '30.251', '35.231');

add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 2 до 3 равен:', 
	'3.0591', '!4.9796', '8.0387', '9.697', '14.677', '17.736', '20.554', '30.251', '35.231');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 2 до 4 равен:', 
	'3.0591', '4.9796', '8.0387', '9.697', '!14.677', '17.736', '20.554', '30.251', '35.231');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 2 до 5 равен:', 
	'3.0591', '4.9796', '8.0387', '9.697', '14.677', '17.736', '20.554', '30.251', '!35.231');

add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 3 до 4 равен:', 
	'3.0591', '4.9796', '8.0387', '!9.697', '14.677', '17.736', '20.554', '30.251', '35.231');
add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 3 до 5 равен:', 
	'3.0591', '4.9796', '8.0387', '9.697', '14.677', '17.736', '20.554', '!30.251', '35.231');

add_tsk( 'Интеграл функции <br><br><center>' +sfunc + '</center> на отрезке от 4 до 5 равен:', 
	'3.0591', '4.9796', '8.0387', '9.697', '14.677', '17.736', '!20.554', '30.251', '35.231');


